In [1]:
import pandas as pd

In [2]:
data = [['raju',35],['subham', 45], ['raja', 66],['bheeem',55]]

In [3]:
data

[['raju', 35], ['subham', 45], ['raja', 66], ['bheeem', 55]]

In [5]:
pd.DataFrame(data, columns=["Name", "Markds"])

     Name  Markds
0    raju      35
1  subham      45
2    raja      66
3  bheeem      55

In [6]:
data2 = {"a": [2,32,12], "b" :[34,232,32]}

In [7]:
data2

{'a': [2, 32, 12], 'b': [34, 232, 32]}

In [15]:
df = pd.DataFrame(data2, )